tests/Fixtures/stripe-invoice-paid.json

{
    "id": "evt_1PRtvO2KksipQSyK3NzaVH4i",
    "object": "event",
    "api_version": "2024-04-10",
    "created": 1718447614,
    "type": "invoice.paid",
    "data": {
        "object": {
            "id": "in_1S8agP2KksipQSyK6gcwGW8q",
            "object": "invoice",
            "account_country": "SE",
            "account_name": "MySoftwareJourney",
            "account_tax_ids": [
            ],
            "amount_due": 3000,
            "amount_overpaid": 0,
            "amount_paid": 3000,
            "amount_remaining": 0,
            "amount_shipping": 0,
            "application": null,
            "application_fee_amount": null,
            "applied_balance": 0,
            "attempt_count": 1,
            "attempted": true,
            "auto_advance": false,
            "automatic_tax": {
                "disabled_reason": null,
                "enabled": true,
                "liability": {
                    "type": "self"
                },
                "provider": "stripe",
                "status": "complete"
            },
            "automatically_finalizes_at": null,
            "billing_reason": "manual",
            "can_send_invoice": true,
            "can_send_receipt": true,
            "charge": "ch_3S8b2k2KksipQSyK09du87No",
            "closed": true,
            "closed_at": 1758175810,
            "collection_method": "charge_automatically",
            "created": 1758174425,
            "currency": "sek",
            "custom_fields": null,
            "customer": "cus_SF5PGh60JEglp4",
            "customer_address": {
                "city": "Skövde",
                "country": "SE",
                "line1": "Lundenvägen 31B",
                "line2": "",
                "postal_code": "549 39",
                "state": ""
            },
            "customer_description": "Test2",
            "customer_email": "roberth@teoricentralen.se",
            "customer_metadata": {
            },
            "customer_name": "Test Customer",
            "customer_phone": "+46703134213",
            "customer_shipping": {
                "address": {
                    "city": "Skövde",
                    "country": "SE",
                    "line1": "Lundenvägen 31B",
                    "line2": "",
                    "postal_code": "549 39",
                    "state": ""
                },
                "name": "Test Customer",
                "phone": "+46703134213"
            },
            "customer_tax_exempt": "none",
            "customer_tax_ids": [
            ],
            "default_payment_method": null,
            "default_source": null,
            "default_tax_rates": [
            ],
            "deleted": false,
            "description": null,
            "discount": null,
            "discount_amount": 0,
            "discount_objects": [
            ],
            "discounts": [
            ],
            "draft": false,
            "due_date": null,
            "effective_at": 1758175810,
            "ending_balance": 0,
            "finalized_payment_method_types": [
                "card",
                "link"
            ],
            "footer": "Thank you",
            "forgiven": false,
            "from_invoice": null,
            "frozen": true,
            "has_paid_non_default_payment": false,
            "has_partial_payments": false,
            "hosted_invoice_url": "https://invoice.stripe.com/i/acct_1PRHrD2KksipQSyK/test_YWNjdF8xUFJIckQyS2tzaXBRU3lLLF9UNGtBMllBdVJ0R0NiOWZLNDJGVUJzQVRubk9PTDFuLDE0ODcxNjYxMg0200Isi9w8IY?s=db",
            "invoice_pdf": "https://pay.stripe.com/invoice/acct_1PRHrD2KksipQSyK/test_YWNjdF8xUFJIckQyS2tzaXBRU3lLLF9UNGtBMllBdVJ0R0NiOWZLNDJGVUJzQVRubk9PTDFuLDE0ODcxNjYxMg0200Isi9w8IY/pdf?s=db",
            "issuer": {
                "type": "self"
            },
            "last_finalization_error": null,
            "last_payment_attempt": 1758175810,
            "latest_revision": null,
            "lines": {
                "object": "list",
                "data": [
                    {
                        "id": "il_1S8atB2KksipQSyKGEnSo1RL",
                        "object": "line_item",
                        "amount": 2000,
                        "amount_excluding_tax": 1600,
                        "computed_amount": 2000,
                        "currency": "sek",
                        "description": "Test",
                        "discount_amounts": [
                        ],
                        "discount_objects": [
                        ],
                        "discountable": true,
                        "discounts": [
                        ],
                        "invoice": "in_1S8agP2KksipQSyK6gcwGW8q",
                        "invoice_item": "ii_1S8atB2KksipQSyKV22h6SHa",
                        "invoice_item_persisted": true,
                        "livemode": false,
                        "metadata": {
                        },
                        "parent": {
                            "invoice_item_details": {
                                "invoice_item": "ii_1S8atB2KksipQSyKV22h6SHa",
                                "proration": false,
                                "proration_details": {
                                    "credited_items": null
                                },
                                "subscription": null
                            },
                            "subscription_item_details": null,
                            "type": "invoice_item_details"
                        },
                        "period": {
                            "end": 1758175217,
                            "start": 1758175217
                        },
                        "plan": null,
                        "pretax_credit_amounts": [
                        ],
                        "price": {
                            "id": "price_1S8ahF2KksipQSyK7eKJjzRL",
                            "object": "price",
                            "active": true,
                            "automatic_currency_conversion_eligible": false,
                            "billing_scheme": "per_unit",
                            "created": 1758174477,
                            "currency": "sek",
                            "custom_unit_amount": null,
                            "livemode": false,
                            "lookup_key": null,
                            "metadata": {
                            },
                            "never_used": false,
                            "nickname": null,
                            "owning_merchant": "acct_1PRHrD2KksipQSyK",
                            "owning_merchant_info": "acct_1PRHrD2KksipQSyK",
                            "product": "prod_SBSFJ4eAmNmAKz",
                            "recurring": null,
                            "tax_behavior": "inclusive",
                            "tiers_mode": null,
                            "transform_quantity": null,
                            "type": "one_time",
                            "unit_amount": 1000,
                            "unit_amount_decimal": "1000"
                        },
                        "price_backfilled": false,
                        "pricing": {
                            "price_details": {
                                "price": "price_1S8ahF2KksipQSyK7eKJjzRL",
                                "product": "prod_SBSFJ4eAmNmAKz"
                            },
                            "type": "price_details",
                            "unit_amount_decimal": "1000"
                        },
                        "proration": false,
                        "proration_details": {
                            "credited_items": null
                        },
                        "quantity": 2,
                        "rendering": null,
                        "subscription": null,
                        "tax_amounts": [
                            {
                                "amount": 400,
                                "inclusive": true,
                                "percentage_requires_explanation": false,
                                "tax_rate": "txr_1S8atB2KksipQSyKa6IgXPlo",
                                "taxability_reason": "standard_rated",
                                "taxable_amount": 1600
                            }
                        ],
                        "tax_rates": [
                        ],
                        "taxes": [
                            {
                                "amount": 400,
                                "tax_behavior": "inclusive",
                                "tax_rate_details": {
                                    "tax_rate": "txr_1S8atB2KksipQSyKa6IgXPlo"
                                },
                                "taxability_reason": "standard_rated",
                                "taxable_amount": 1600,
                                "type": "tax_rate_details"
                            }
                        ],
                        "type": "invoiceitem",
                        "unit_amount": 1000,
                        "unit_amount_decimal": "1000",
                        "unit_amount_excluding_tax": "800"
                    },
                    {
                        "id": "il_1S8amv2KksipQSyKPLAZOzYx",
                        "object": "line_item",
                        "amount": 1000,
                        "amount_excluding_tax": 800,
                        "computed_amount": 1000,
                        "currency": "sek",
                        "description": "Test",
                        "discount_amounts": [
                        ],
                        "discount_objects": [
                        ],
                        "discountable": true,
                        "discounts": [
                        ],
                        "invoice": "in_1S8agP2KksipQSyK6gcwGW8q",
                        "invoice_item": "ii_1S8amv2KksipQSyKbN7pYUSh",
                        "invoice_item_persisted": true,
                        "livemode": false,
                        "metadata": {
                        },
                        "parent": {
                            "invoice_item_details": {
                                "invoice_item": "ii_1S8amv2KksipQSyKbN7pYUSh",
                                "proration": false,
                                "proration_details": {
                                    "credited_items": null
                                },
                                "subscription": null
                            },
                            "subscription_item_details": null,
                            "type": "invoice_item_details"
                        },
                        "period": {
                            "end": 1758174829,
                            "start": 1758174829
                        },
                        "plan": null,
                        "pretax_credit_amounts": [
                        ],
                        "price": {
                            "id": "price_1S8ahF2KksipQSyK7eKJjzRL",
                            "object": "price",
                            "active": true,
                            "automatic_currency_conversion_eligible": false,
                            "billing_scheme": "per_unit",
                            "created": 1758174477,
                            "currency": "sek",
                            "custom_unit_amount": null,
                            "livemode": false,
                            "lookup_key": null,
                            "metadata": {
                            },
                            "never_used": false,
                            "nickname": null,
                            "owning_merchant": "acct_1PRHrD2KksipQSyK",
                            "owning_merchant_info": "acct_1PRHrD2KksipQSyK",
                            "product": "prod_SBSFJ4eAmNmAKz",
                            "recurring": null,
                            "tax_behavior": "inclusive",
                            "tiers_mode": null,
                            "transform_quantity": null,
                            "type": "one_time",
                            "unit_amount": 1000,
                            "unit_amount_decimal": "1000"
                        },
                        "price_backfilled": false,
                        "pricing": {
                            "price_details": {
                                "price": "price_1S8ahF2KksipQSyK7eKJjzRL",
                                "product": "prod_SBSFJ4eAmNmAKz"
                            },
                            "type": "price_details",
                            "unit_amount_decimal": "1000"
                        },
                        "proration": false,
                        "proration_details": {
                            "credited_items": null
                        },
                        "quantity": 1,
                        "rendering": null,
                        "subscription": null,
                        "tax_amounts": [
                            {
                                "amount": 200,
                                "inclusive": true,
                                "percentage_requires_explanation": false,
                                "tax_rate": "txr_1S8atB2KksipQSyKa6IgXPlo",
                                "taxability_reason": "standard_rated",
                                "taxable_amount": 800
                            }
                        ],
                        "tax_rates": [
                        ],
                        "taxes": [
                            {
                                "amount": 200,
                                "tax_behavior": "inclusive",
                                "tax_rate_details": {
                                    "tax_rate": "txr_1S8atB2KksipQSyKa6IgXPlo"
                                },
                                "taxability_reason": "standard_rated",
                                "taxable_amount": 800,
                                "type": "tax_rate_details"
                            }
                        ],
                        "type": "invoiceitem",
                        "unit_amount": 1000,
                        "unit_amount_decimal": "1000",
                        "unit_amount_excluding_tax": "800"
                    }
                ],
                "has_more": false,
                "total_count": 2,
                "url": "/v1/invoices/in_1S8agP2KksipQSyK6gcwGW8q/lines"
            },
            "livemode": false,
            "metadata": {
            },
            "next_payment_attempt": null,
            "number": "4A3B0D75-0004",
            "on_behalf_of": null,
            "only_finalize": true,
            "owning_merchant": "acct_1PRHrD2KksipQSyK",
            "owning_merchant_info": "acct_1PRHrD2KksipQSyK",
            "paid": true,
            "paid_out_of_band": false,
            "paper_checks": [
            ],
            "parent": null,
            "payment_intent": "pi_3S8b2k2KksipQSyK0INyVty0",
            "payment_method_selection": "payment_settings",
            "payment_pending": false,
            "payment_settings": {
                "default_mandate": null,
                "payment_method_options": null,
                "payment_method_types": null
            },
            "period_end": 1758174425,
            "period_start": 1758174425,
            "post_payment_credit_notes_amount": 0,
            "pre_payment_credit_notes_amount": 0,
            "quote": null,
            "receipt_number": null,
            "redaction": null,
            "reminders_count": 0,
            "rendering": {
                "amount_tax_display": null,
                "fields": {
                    "custom_fields": {
                        "source": "manual",
                        "value": null
                    },
                    "description": null,
                    "footer": {
                        "source": "manual",
                        "value": "Thank you"
                    }
                },
                "pdf": {
                    "page_size": "a4"
                },
                "template": null,
                "template_version": null
            },
            "rendering_options": {
                "amount_tax_display": null
            },
            "rendering_pdf_page_size": "a4",
            "secret": "test_YWNjdF8xUFJIckQyS2tzaXBRU3lLLF9UNGtBMllBdVJ0R0NiOWZLNDJGVUJzQVRubk9PTDFuLDE0ODcxNjYxMg0200Isi9w8IY",
            "send_hosted_payment_email": false,
            "shipping_cost": null,
            "shipping_details": null,
            "starting_balance": 0,
            "statement_descriptor": null,
            "statement_records_count": 0,
            "status": "paid",
            "status_transitions": {
                "finalized_at": 1758175810,
                "marked_uncollectible_at": null,
                "paid_at": 1758175810,
                "voided_at": null
            },
            "subscription": null,
            "subscription_details": {
                "metadata": null
            },
            "subtotal": 3000,
            "subtotal_excluding_tax": 2400,
            "supported_payment_methods": {
                "amazon_pay": false,
                "card": true,
                "klarna": false,
                "link": true,
                "wechat_pay": false
            },
            "tax": 600,
            "test_clock": null,
            "total": 3000,
            "total_discount_amounts": [
            ],
            "total_excluding_tax": 2400,
            "total_pretax_credit_amounts": [
            ],
            "total_tax_amounts": [
                {
                    "amount": 600,
                    "inclusive": true,
                    "percentage_requires_explanation": false,
                    "tax_rate": "txr_1S8atB2KksipQSyKa6IgXPlo",
                    "taxability_reason": "standard_rated",
                    "taxable_amount": 2400
                }
            ],
            "total_taxes": [
                {
                    "amount": 600,
                    "tax_behavior": "inclusive",
                    "tax_rate_details": {
                        "tax_rate": "txr_1S8atB2KksipQSyKa6IgXPlo"
                    },
                    "taxability_reason": "standard_rated",
                    "taxable_amount": 2400,
                    "type": "tax_rate_details"
                }
            ],
            "transfer_data": null,
            "updated": 1758175812,
            "voided": false,
            "webhooks_delivered_at": 1758174425
        }
    }
}
